Revit 2024 API
FabricLocation Enumeration
 Fabric location in the host
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Since: 2013
Syntax
C#
public enum FabricLocation
Visual Basic
Public Enumeration FabricLocation
Visual C++
public enum class FabricLocation
Members
Member name | Description
TopOrExternal |  The fabric is on the top face of a floor host, or on the external face of a wall host.
BottomOrInternal |  The fabric is on the bottom face of a floor host, or on the internal face of a wall host.
See Also
Autodesk.Revit.DB.Structure Namespace